// ملف آخر يحتوي على بعض الدوال
const lib = require('./lib');

// هذا هو مكان النص
let text = `
مرحبا بكم في منزلنا
مرحبا بكم في منزلنا
اشعة او أشعة او اشعّه
`;

// في البداية سيتخلص من التشكيلات بالعربية
text = lib.normalize_text(text);

// ثم سيحول النص الى مصفوفة ويقوم بحذف المتكررة
let arr = lib.get_just_unique_word(text);

// طباعة الكلمات الفريدة
console.log(arr);

// طباعة عدد الكلمات الفريدة
console.log("عدد الكلمات الفريدة هو : ", arr.length);

// عدد الكلمات في النص الاصلي مع المتكررة
console.log("عدد الكلمات ككل هو : ", text.split(" ").length);